class ResultTicketFactory {
    static descriptions = {
        'SUCCESS01': 'Сервіс аналізу перевірив ваш файл та не знайшов жодних помилок.',
        'ERR01': 'Сталась непередбачена помилка підключення до сервісу аналізу. Спробуйте пізніше або зверніться до адміністратора.',
        'ERR02': 'Ваш файл не було розпізнано як коректний .docx файл сервісом аналізу.',
        'REF01': 'У вашому тексті не знайдено жодного посилання вигляду [1] або (author, year). Для деяких із документів відсутність посилань дуже малоймовірна (напр., розділи 1-2 ПЗ).',
        'REF02': 'Посилання за ДСТУ нумеруються у порядку їх появи у тексті.',
        'LAY01': 'Всі документи оформлюються на папері розміру А4 (210 на 297 мм).',
        'LAY02': 'Для більшості з документів ліве поле має становити 3 см, інші – по 2 см.',
        'ORT01': 'За <a href="https://bit.ly/3yqbzYg" target="_blank">новим правописом</a> треба писати: про<strong>є</strong>кт, а не проект; компонент "веб" разом з наступним словом, наприклад, <strong>веб</strong>сайт, а не веб сайт або веб-сайт.',
        'ORT02': 'Уникайте українсько-англійського суржику. Наприклад, не девайс, а пристрій; не нотифікація, а сповіщення.',
        'ORT03': 'Можливе використання слова у неправильному контексті. Деталі див. за <a href="misuse.txt" target="_blank">посиланням</a>.',
        'ORT04': 'Серед символів кирилиці знайдено символ латиниці або навпаки. Системою антиплагіату це буде розцінено як підміна символів для приховування плагіату.',
        'PNC01': 'Перед більшістю пунктуаційних знаків пробіл не ставиться, а після – ставиться. Тире відбивається пробілами з обох боків (а всередині слів, таких як "будь-який", використовується дефіс).',
        'PNC02': 'Найбільш вживаними є лапки-ялинки «…», хоча <a href="http://bit.ly/3ZJPRKf" target="_blank">правопис 2019-го року</a> допускає використання і інших варіантів: “…”, „…“.',
        'PNC03': 'Поширені типографські помилки: дефіс (-, U+002D) або довге тире (—, U+2014) замість тире (–, U+2013); три крапки окремими символами (., U+002E), замість одного (…, U+2026); ASCII-апостроф (\', U+0027) або знак акцента (`, U+0060) замість звичайного (’, U+2019).',
        'STL01': 'Уникайте українсько-англійського суржику. Наприклад, не девайс, а пристрій; не нотифікація, а сповіщення.',
        'STL02': 'При академічному стилі письма використання особових (я, ми) чи присвійних (мій, наш) займенників практично не допускається. "Я" можна використовувати, наприклад, у тексті user story.',
        'TBL01': 'Підпис таблиці розміщується безпосередньо перед нею та має вигляд "Таблиця [номер розділу].[номер за порядком у межах розділу][новий рядок]Назва таблиці" або "Продовження табл. [номер розділу].[номер за порядком у межах розділу]".',
        'TBL02': 'Номер таблиці складається з двох чисел: номер розділу, в якому знаходиться таблиця, та номер таблиці у межах розділу. У межах розділу таблиці нумеруються за порядком їх появи, без пропусків та перестановок.',
        'TBL03': 'На будь-яку таблицю повинне бути посилання в тексті до неї, виду "див. табл. 1.1".',
        'TBL04': 'Таблиці повинні займати всю вільну ширину аркуша, не виходячи на поля (для стандартних полів, визначених правилом LAY02, та аркушу А4 це означає ширину 16 сантиметрів).',
        'IMG01': 'Кожен рисунок підписується наступним рядком відразу після нього. Підпис має наступний формат: "Рис. [номер розділу].[номер за порядком у межах розділу]. Назва рисунку".',
        'IMG02': 'Номер рисунку складається з двох чисел: номер розділу, в якому знаходиться рисунок, та номер рисунку у межах розділу. У межах розділу рисунки нумеруються за порядком їх появи, без пропусків та перестановок.',
        'IMG03': 'На будь-який рисунок повинне бути посилання в тексті до нього, виду "див. рис. 1.1" або "на рисунку 1.1 зображено...".',
        'IMG04': 'Рисунок не повинен виходити на поля аркуша (для стандартних полів, визначених правилом LAY02, та аркушу А4 це означає максимальну ширину рисунку 16 сантиметрів).',
        'IMG05': 'Рисунок та його підпис повинні бути вирівнянні по центру та не мати жодних відступів (ліворуч / праворуч / першого рядка / навислого).'
    };

    static create(code, extra, isError) {
        let template = document.importNode(document.getElementById('ticket-template'), true);
        let div = template.content.querySelector('div');
        let codeParagraph = template.content.querySelector('.code');
        let extraParagraph = template.content.querySelector('.extra');
        let descriptionParagraph = template.content.querySelector('.description');

        extra = extra || '';
        extra = extra.replace(/\[highlight\](.*)\[highlight\]/, (_, g1) => {
            return `<mark>${g1}</mark>`;
        });

        div.classList.add(code === 'SUCCESS01' ? 'success' : (isError ? 'error' : 'warning'));
        codeParagraph.innerHTML = code;
        extraParagraph.innerHTML = extra;
        descriptionParagraph.innerHTML = this.descriptions[code];

        return template.content;
    }
}